<script lang="ts">
  import Header from '../parts/Header.svelte'
</script>


<Header title="Top" type="site" url="" description="ポケモンユナイト大会の情報収集" />

<p><a href="https://www.pokemonunite.jp/">ポケモンユナイト</a>の大会結果をメモしてく場所です。各種大会の結果を集めて、名前で寄せて集計してます。</p>
<p>サイト内のデータは基本的に各大会で使用されたトーナメントサイトから取得したデータをそのまま使用していますが、各種SNSのアカウント、名寄せ等に誤りがある場合はメンションかDMでお知らせください。</p>
<p>
  <a href="https://twitter.com/K2Da" target="_blank">twitter</a> /
  <a href="https://discordapp.com/users/178654656694714370" target="_blank">Discord</a>
</p>

<h2>お願い</h2>
<p>
  <a href="https://battlefy.com/pokemon-unite-championship-series-2022/">Pokémon UNITE Championship Series</a>のトーナメント表が、公式サイトで発表されていません。過去大会のURLは検索エンジンで発見できたのですが、今後も、自力で発見できるか怪しいため、ご存知の方は教えていただけるとありがたいです。2月分もNA、SA、JP以外は発見できていないため、ご存知だったら教えてください！ 以下のような形式のURLです。
</p>
<p>2月: https://battlefy.com/pok%C3%A9mon-unite-championship-series/february-monthly-open-qualifier-[region]/[????]/</p>
<p>3月のAPAC(アジア太平洋): https://battlefy.com/pok%C3%A9mon-unite-championship-series/march-monthly-open-qualifier-day-1-apac/621fadf68694796bab628982/stage/622c1a855ff8590591648d69/bracket/</p>

<h2>etc</h2>
<h3>収集対象大会</h3>
<p>基本的に、日本の公式大会はすべて、その他の大会は参加人数が多いものを収集対象としたいと思ってます。</p>

<p>しかし、データを投入するには、各試合結果含むトーナメント表 + チーム名 + メンバー名がデータの形で必要です。先述のとおり、Pokémon UNITE Championship Seriesのトーナメント表は存在してますが、公式にはURLが発表されていないので、今後、URLを見つけられなかった場合は収集できません。</p>
<p>また、過去の非公式大会で規模が大きく、結果を収集しようとしたが、チームのメンバー情報を効率よく取得する方法がない(か、自分が見つけられていない)ため、収集していない大会がいくつか存在しています。主に、Tonamelを使用して開催された大会が該当しますので、参加チームのメンバー情報をTonamelから効率よく取得する方法をご存知の方は教えていただけるとありがたいです。</p>

<h3>プレイヤー名について</h3>
<p>原則、大会に参加した名前が同じだったら同じプレイヤーであるとして集計していますが、一部、おそらく、おなじプレイヤーであろうとおもわれる名前については、複数の文字列をおなじプレイヤーとして扱うよう、手動で設定しています。</p>

<p>公式大会含め、ほとんどの大会は、プレイヤー名 == ゲーム内のトレイナー名ですが、一部そうでない大会もあります。そのため、同じ登録名で違うプレイヤーが出場することなどが想定されますが、現在の所、申請が重複したため同じプレイヤーが2チームに登録されていると思われる場合を除き、そうしたケースは発生していないようです。</p>

<h3>チーム名について</h3>
<p>チーム名は、表記ゆれと思われるものや、ほぼ同じメンバーで別の名前になっているものについては同一のチームとみなし、一番最近使われた名前を正式名称として扱っています。</p>
<p>公式大会では、使用できないチーム名だった場合に、〇〇さんチームと変更されている場合があります。</p>

<h3>ratingについて</h3>
<p>プレイヤーのリストを表示する際、勝利数順だと試合数の多い総当り大会の影響が大きくなりすぎるため、<a href="https://ja.wikipedia.org/wiki/%E3%82%A4%E3%83%AD%E3%83%AC%E3%83%BC%E3%83%86%E3%82%A3%E3%83%B3%E3%82%B0">イロレーティング</a>で個人のratingを付けています。初期値1,500、係数は400です。</p>
<p>各メンバーが、相手チームの平均レートのプレイヤーと戦ったものとしてレートを変動させています。味方のレートは考慮していません。</p>
<p>BO3などの場合、勝敗の順序が不明なため、勝者側の敗戦試合 -> 勝者側の勝利試合、の順で計算しています。</p>
<p>スコアが0-0の場合、棄権などで試合が行われなかったものと推測し、レートを変動させていません。その大会における、すべての試合が0-0となっているチームは不参加と見なし、記録を削除しています。このため、最終順位に抜けている順位が存在する可能性があります</p>