<script lang="ts">
  import Header from '../parts/Header.svelte'
</script>


<Header title="Top" type="site" url="" description="ポケモンユナイト大会の情報収集" />

<p><a href="https://www.pokemonunite.jp/">ポケモンユナイト</a>の大会結果をメモしてく場所です。各種大会の結果を集めて、名前で寄せて集計してます。</p>
<p>サイト内のデータは基本的に各大会で使用されたトーナメントサイトから取得したデータをそのまま使用していますが、各種SNSのアカウント、名寄せ等に誤りがある場合はメンションでお知らせください。</p>
<a href="https://twitter.com/intent/tweet?screen_name=K2Da&ref_src=twsrc%5Etfw" class="twitter-mention-button" data-show-count="false">Tweet to @K2Da</a>

<h2>お願い</h2>
<p>
  <a href="https://battlefy.com/pokemon-unite-championship-series-2022/">Pokémon UNITE Championship Series</a>のトーナメント表が、公式サイトで発表されていません。2月大会のURLは検索エンジンで発見できたのですが、3月以降、自力で発見できるか怪しいため、ご存知の方は教えていただけるとありがたいです。2月分もNA、SA、JP以外は発見できていないため、ご存知だったら教えてください！ 以下のような形式のURLです。
</p>
<p>https://battlefy.com/pok%C3%A9mon-unite-championship-series/february-monthly-open-qualifier-[region]/[????]/</p>

<h2>etc</h2>
<h3>プレイヤー名について</h3>
<p>原則、大会に参加した名前が同じだったら同じプレイヤーであるとして集計していますが、一部、おそらく、おなじプレイヤーであろうとおもわれる名前については、複数の文字列をおなじプレイヤーとして扱うよう、手動で設定しています。</p>

<p>公式大会含め、ほとんどの大会は、プレイヤー名 == ゲーム内のトレイナー名ですが、一部そうでない大会もあります。そのため、同じ登録名で違うプレイヤーが出場することなどが想定されますが、現在の所、申請が重複したため同じプレイヤーが2チームに登録されていると思われる場合を除き、そうしたケースは発生していないようです。</p>

<h3>チーム名について</h3>
<p>チーム名は、表記ゆれと思われるものや、ほぼ同じメンバーで別の名前になっているものについては同一のチームとみなし、一番最近使われた名前を正式名称として扱っています。</p>
<p>公式大会では、使用できないチーム名だった場合に、〇〇さんチームと変更されている場合があります。</p>

<h3>ratingについて</h3>
<p>プレイヤーのリストを表示する際、勝利数順だと試合数の多い総当り大会の影響が大きくなりすぎるため、<a href="https://ja.wikipedia.org/wiki/%E3%82%A4%E3%83%AD%E3%83%AC%E3%83%BC%E3%83%86%E3%82%A3%E3%83%B3%E3%82%B0">イロレーティング</a>で個人のratingを付けています。初期値1,500、係数は400です。</p>
<p>各メンバーが、相手チームの平均レートのプレイヤーと戦ったものとしてレートを変動させています。味方のレートは考慮していません。</p>
<p>BO3などの場合、勝敗の順序が不明なため、勝者側の敗戦試合 -> 勝者側の勝利試合、の順で計算しています。</p>
<p>スコアが0-0の場合、棄権などで試合が行われなかったものと推測し、レートを変動させていません。</p>
